scabootssca/weatherstation/Src/ESP8266/OLD/ESP8266.ino.REFERENCE.cpp
/*
Copyright 2017 Jason Ryan Richards

MIT License

Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"),
to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense,
and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/
#define DEBUG 3

#if DEBUG
#define DEBUG_PRINT(...) Serial.print( __VA_ARGS__ )
#define DEBUG_PRINTLN(...) Serial.println( __VA_ARGS__ )
#else
#define DEBUG_PRINT(...)
#define DEBUG_PRINTLN(...)
#endif

// Includes
#include <Wire.h>
#include <SPI.h>

#include <ESP8266WiFi.h>

#include "./config.h"
#include "./helpers.h"

#include "RTClib.h"
#include "./Adafruit_MCP23008.h"
#include <Adafruit_BME280.h>

// Esp Pin Assignments
#define SW_SERIAL_TX_PIN D1
#define SW_SERIAL_RX_PIN D2
#define SDA_PIN D3 // GPIO0 /*D1 // GPIO5*/
#define SCL_PIN D4 // GPIO2
#define SPI_CLOCK_PIN D5
#define SPI_MOSI_PIN D6
#define SPI_MISO_PIN D7

// IO Expander Pin Assignments
#define ERROR_LED_PIN 0
#define OK_LED_PIN 1
#define REFV_ENABLE_PIN 2
#define SOLAR_ENABLE_PIN 3
#define BAT_DIV_ENABLE_PIN 4
//#define REFV_ENABLE_PIN 5
#define ATTINY_DATA_REQUEST_PIN 6
#define ADC_CS_PIN 7

// ADC Pin Assignments
#define ADC_REF_PIN 0
#define WIND_VANE_PIN 6
#define BAT_ADC_PIN 7

// Flags
  // Reading settings
#define READING_INTERVAL 300000 // 300000 is 5 minutes in ms
#define SAMPLE_INTERVAL 2000
#define SAMPLES_PER_READING READING_INTERVAL/SAMPLE_INTERVAL // How many samples to average for a reading 300000/2000 = 30 for one every 2 seconds
#define BATTERY_SAMPLE_MODULO 20 // Every X samples check the battery

#define MAX_READING_STORAGE 288//576 // How many readings to store in memory; 288 with 300000 ms samples (5 min) is 24 hours; 576 = 48 hours
#define READING_SUBMIT_INTERVAL 1 // How many to have before attempting to submit
#define MAX_FAILED_SUBMITS 3

#define SAMPLE_INDICATOR_LED_ENABLED true // Will flash each sample

// Instrument settings
// Anemometer
// rpm/coef = wind speed in mph
#define ANEMOMETER_CALIBRATION_COEF 0.09739260404185239 // 10.2677201193868 = samples per 1mph

// Wind Vane
#define WIND_VANE_MIN 0
#define WIND_VANE_MAX 1023

// Globals
unsigned long lastSampleMillis =0;

// Init structures
RTC_DS1307 RTC; // Real Time Clock
Adafruit_MCP23008 mcp; // IO Expander
Adafruit_BME280 bmeSensor; // Termometer, Hygrometer, Barometer

// // Serial connection to ATtiny
// #include <SoftwareSerial.h>
// SoftwareSerial ATtinySerial(SW_SERIAL_RX_PIN, -1);

void setup() {
  Serial.begin(19200);

	// SoftwareSerial
	//ATtinySerial.begin(9600);
}








void loop() {
	while (ATtinySerial.available()) {
		Serial.write(ATtinySerial.read());
	}

	if (millis()-lastSampleMillis > SAMPLE_INTERVAL) {
		lastSampleMillis = millis();

		// Send it to attiny for storage
		ATtinySerial.println("Frogs");

		Serial.println("Sleeping Now.");
	}
}


// WiFi
#include <ESP8266WiFi.h>

// Required for LIGHT_SLEEP_T delay mode
extern "C" {
#include "user_interface.h"
}

// WiFi and Network Variables and GMT offset
#include "./config.h"

// Helpers
#include "./helpers.h"

// Sensor Includes
#include "RTClib.h"

#include "./Adafruit_MCP23008.h"
#include <Adafruit_Sensor.h>

#if BME_SENSOR == SENS_BME280
#include <Adafruit_BME280.h>
#endif

#if BME_SENSOR == SENS_BMP180
#include <Adafruit_BMP085.h>
#endif

// Wifi Variables
IPAddress wifi_ip(MY_IP);
IPAddress wifi_gateway(GATEWAY_IP);
IPAddress wifi_subnet(SUBNET_MASK);

#define DEEP_SLEEP_MODE 0
#define COMPANION_MODE 1
#define CALIBRATION_MODE 0

#if CALIBRATION_MODE
int CALIB_windVaneMax = 0;
int CALIB_windVaneMin = 1024;
#endif

// Config
#define READING_INTERVAL 300000 // 300000 is 5 minutes in ms
#define SAMPLE_INTERVAL 2000
#define SAMPLES_PER_READING READING_INTERVAL/SAMPLE_INTERVAL // How many samples to average for a reading 300000/2000 = 30 for one every 2 seconds
#define BATTERY_SAMPLE_MODULO 20 // Every X samples check the battery

#define MAX_READING_STORAGE 288//576 // How many readings to store in memory; 288 with 300000 ms samples (5 min) is 24 hours; 576 = 48 hours
#define READING_SUBMIT_INTERVAL 1 // How many to have before attempting to submit
#define MAX_FAILED_SUBMITS 3

#define SAMPLE_INDICATOR_LED_ENABLED true // Will flash each sample

// Esp Pin Assignments
#define SW_SERIAL_TX_PIN D1
#define SW_SERIAL_RX_PIN D2
#define SDA_PIN D3 // GPIO0 /*D1 // GPIO5*/
#define SCL_PIN D4 // GPIO2
#define SPI_CLOCK_PIN D5
#define SPI_MOSI_PIN D6
#define SPI_MISO_PIN D7

// IO Expander Pin Assignments
#define ERROR_LED_PIN 0
#define OK_LED_PIN 1
#define REFV_ENABLE_PIN 2
#define SOLAR_ENABLE_PIN 3
#define BAT_DIV_ENABLE_PIN 4
//#define REFV_ENABLE_PIN 5
#define ATTINY_DATA_REQUEST_PIN 6
#define ADC_CS_PIN 7

// ADC Pin Assignments
#define ADC_REF_PIN 0
#define WIND_VANE_PIN 6
#define BAT_ADC_PIN 7

// Serial connection to ATtiny
#include <SoftwareSerial.h>
SoftwareSerial ATtinySerial(SW_SERIAL_RX_PIN, SW_SERIAL_TX_PIN);
bool ATtinyNewline = true;

char attinyReplyBuffer[11]; // 1 + 4 + 1 + 4 + 1 == (~ Int1 ! Int2 \n)
short attinyReplyBufferIndex = 0;
bool attinyReplyBuffering = false;

/*********************
* Instrument Settings
*********************/
// Anemometer
// rpm/coef = wind speed in mph
#define ANEMOMETER_CALIBRATION_COEF 0.09739260404185239 // 10.2677201193868 = samples per 1mph

// Wind Vane
#define WIND_VANE_MIN 0
#define WIND_VANE_MAX 1023

// Globals
unsigned long totalReadings = 0;
unsigned long powerOnTime;

WeatherReadingAccumulator *sampleAccumulator = new WeatherReadingAccumulator;
int numSamples = 0;

WeatherReading storedReadings[MAX_READING_STORAGE];
int readingIndex = 0;
short int serverDownCounter = 0;


