scabootssca/weatherstation/Src/ESP8266/OLD/ESP8266.ino.REFERENCE.cpp
int okLedState = HIGH;
unsigned long lastSampleMillis = 0;

// Real Time Clock
RTC_DS1307 RTC;

// IO Expander
Adafruit_MCP23008 mcp;

// Sensors
/**********/
// BME 280
#if BME_SENSOR == SENS_BME280
Adafruit_BME280 bmeSensor;
#endif

#if BME_SENSOR == SENS_BMP180
Adafruit_BMP085 bmeSensor;
#endif

bool bmeConnected = true;

unsigned long lastAnemometerReadingMillis = 0;
volatile unsigned int anemometerPulseCount = 0;
volatile unsigned long anemometerSampleSum = 0;
volatile unsigned int anemometerSampleCount = 0;

volatile bool hasInterrupt = false;

void print_raw_attiny_buffer() {
	Serial.print("Recieved from ATtiny Raw: ");

	for (int i=0;i<attinyReplyBufferIndex;i++) {
		for (int bit=7;bit>=0;bit--) {
			Serial.print((attinyReplyBuffer[i]>>bit)&1);
		}

		Serial.print(" ");
	}

	Serial.println();

	Serial.print("Nice:  ");
	Serial.println(attinyReplyBuffer);
}

bool recv_attiny_serial() {
	// Print attiny serial messages
	while (ATtinySerial.available() > 0) {
		uint8_t rxByte = ATtinySerial.read();

		if (ATtinyNewline) {
			ATtinyNewline = false;

			if (!attinyReplyBuffering) {
				Serial.write("[ATtiny]");
			}
		}

		// Print it if it's not a reply to us
		if (!attinyReplyBuffering) {
			Serial.write(rxByte);
		}

		if (rxByte == 126) {
			attinyReplyBufferIndex = 0;
			attinyReplyBuffering = true;
		} else if (rxByte == 10) {
			ATtinyNewline = true;
			attinyReplyBuffering = false;
		}

		if (attinyReplyBuffering && attinyReplyBufferIndex < 5) {
			attinyReplyBuffer[attinyReplyBufferIndex++] = rxByte;
		}
	}
}

bool wait_attiny_data(int timeoutMs = 50) {
	attinyReplyBuffering = true;
	int totalDelayMs = 0;

	do {
		recv_attiny_serial();
		delay(1);
		totalDelayMs++;

		if (totalDelayMs >= timeoutMs) {
			break;
		}
	} while (attinyReplyBuffering);

	// If we timed out
	if (totalDelayMs >= timeoutMs) {
		return false;
	}

	return true;
}

bool connectToWiFi() {
	// If we're connected then return
	if (WiFi.status() == WL_CONNECTED) {
    DEBUG_PRINTLN("Already Connected");
		return true;
	}

  //******************************
  //* Init WiFi
  //******************************
  //noInterrupts();
	WiFi.forceSleepWake();
	//interrupts();
  delay(1);

	//WiFi.persistent(false);

	Serial.print("Connecting to: ");
	Serial.println(WIFI_SSID);

	WiFi.mode(WIFI_STA);

	WiFi.config(wifi_ip, wifi_gateway, wifi_subnet);

	//noInterrupts();
  WiFi.begin(WIFI_SSID, WIFI_PASS);
  //interrupts();


	// Wait for a connection
  unsigned int totalWaitTime = 0;

  while (WiFi.status() != WL_CONNECTED) {
    delay(50);
    totalWaitTime += 50;
    okLedState = !okLedState;
    mcp.digitalWrite(OK_LED_PIN, okLedState ? HIGH : LOW);
    DEBUG_PRINT(".");

    // Wait 30 secs and give up
    if (totalWaitTime > 30000) {
			okLedState = LOW;
			mcp.digitalWrite(OK_LED_PIN, LOW);

      DEBUG_PRINTLN("WiFi error connecting.");
      return false;
    }
  }

  okLedState = LOW;
  mcp.digitalWrite(OK_LED_PIN, LOW);

	DEBUG_PRINTLN("");
	DEBUG_PRINT("IP address: ");
	DEBUG_PRINTLN(WiFi.localIP());
  //DEBUG_PRINT("Strength: ");
  //DEBUG_PRINT(getRSSI(WIFI_SSID));
  //DEBUG_PRINTLN(" db");

  return true;
}

void disconnectFromWiFi() {
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  // //noInterrupts(); // Seems WiFi.disconnect also calls ETS_UART_INTR_DISABLE maybe this can be below it
  // bool disconnected = WiFi.disconnect(true);
	// //interrupts();
	//WiFi.mode(WIFI_OFF);

	//noInterrupts();
  WiFi.forceSleepBegin(); // This'll call mode(WIFI_OFF)
  //interrupts();

	delay(1);

  DEBUG_PRINT("Disconnected from wifi: ");
  //DEBUG_PRINTLN(disconnected);
}

bool submit_reading(WeatherReading currentReading, bool disconnectAfterSubmission=true, bool updateClock=false) {
  bool success = false;

  char outputUrl[300] = "";

  strcat(outputUrl, "/report.php?");

  if (!isnan(currentReading.temperature)) {
    strcat(outputUrl, "temp=");
    strcat(outputUrl, String(currentReading.temperature).c_str());
  }

  if (!isnan(currentReading.humidity)) {
      strcat(outputUrl, "&humidity=");
      strcat(outputUrl, String(currentReading.humidity).c_str());

      // If we have temperature and humidity then calculate and submit the heat index also
      if (!isnan(currentReading.temperature)) {
        strcat(outputUrl, "&heatIndex=");
        strcat(outputUrl, String(computeHeatIndex(currentReading.temperature, currentReading.humidity, false)).c_str());
      }
  }

  if (!isnan(currentReading.pressure)) {
    strcat(outputUrl, "&pressure=");
    strcat(outputUrl, String(currentReading.pressure).c_str());
  }

  strcat(outputUrl, "&bat=");
  strcat(outputUrl, String(currentReading.battery).c_str());
  strcat(outputUrl, "&windSpeed=");
  strcat(outputUrl, String(currentReading.windSpeed).c_str());
  strcat(outputUrl, "&windDirection=");
  strcat(outputUrl, String(currentReading.windDirection).c_str());

  strcat(outputUrl, "&timestamp=");
  strcat(outputUrl, String(currentReading.timestamp).c_str());

  // Secret key for security (>_O)
  strcat(outputUrl, "&key=f6f9b0b8348a85843e951723a3060719f55985fd"); // frie!ggandham!!%2{[ sha1sum

  int port = 80;
  char ip[] = SERVER_IP_ADDRESS;

  // Connect if needed
  if (connectToWiFi()) {
		WiFiClient client;

    Serial.print(ip);
    Serial.print(":");
    Serial.print(port);
    Serial.println(outputUrl);

		if (client.connect(ip, port)) {
			Serial.println("Connection Successful!");

			client.print(String("GET ") + outputUrl + " HTTP/1.1\r\n" +
				"Host: " + ip + "\r\n" +
				"Connection: close\r\n\r\n");

				while (client.connected())
				{
				  if (client.available())
				  {
				    String line = client.readStringUntil('\n');
				    Serial.println(line);
				  }
					yield();
				}

				client.stop();

				success = true;
		} else {
			Serial.println("Connection Failed!");
			client.stop();
		}

		// HTTPClient http;
    //
    // //noInterrupts();
    // http.begin(ip, port, outputUrl); //HTTP
    // //interrupts();
    //
    // Serial.println("Success with http.begin");
    //
    // ////noInterrupts();
    // int httpCode = http.GET();
    // ////interrupts();
    //
    // Serial.print("Got http code: ");
    // Serial.println(httpCode);
    //
    // if(httpCode > 0) {
    //   if(httpCode == HTTP_CODE_OK) {
    //     String payload = http.getString();
    //
    //     Serial.println("Got payload: ");
    //     Serial.println(payload);
    //
    //     if (payload.startsWith("S")) {
    //       if (updateClock) {
    //         // Get the new time
    //         strtok((char*)payload.c_str(), "\n");
    //         char *newTime = strtok(NULL, "\n");
    //         int intTime = atoi(newTime);
    //
    //         Serial.print("Success! Also, setting clock to ");
    //         Serial.println(newTime);
    //
    //         RTC.adjust(DateTime(intTime));
    //       } else {
    //         Serial.print("Success!");
    //       }
    //
    //       success = true;
    //     } else {
    //       Serial.println("Failure: Invalid payload");
    //     }
    //   } else {
    //     Serial.print("Http Error: ");
    //     Serial.println(httpCode);
    //   }
    // } else {
    //   Serial.print("Http Error: ");
    //   Serial.println(httpCode);
    // }
    //
    // //noInterrupts();
    // http.end();
    // //interrupts();
  }

  return success;
}

