scabootssca/weatherstation/Src/ESP8266/OLD/ESP8266.ino.REFERENCE.cpp
void submit_stored_readings() {
  /*
  /* Really need a multiple submit in here, maybe a post with temp[1],temp[2] or temp_1 whatever
  */
  int failedSubmissionIndexes[MAX_READING_STORAGE];
  int failedIndex = 0;

  short numConsecutiveFails = 0;

  // Go through the readings and submit any that are there
  for (int i=0; i<MAX_READING_STORAGE; i++) {
    // If we've reached an unpopulated reading then we've reached the end and stop
    if (storedReadings[i].populated == false) {
      break;
    }

    DEBUG_PRINTLN("");
    DEBUG_PRINT(">> Submitting index: ");
    DEBUG_PRINTLN(i);

    bool success = submit_reading(storedReadings[i], false, !i);

    if (!success) {
			mcp.digitalWrite(ERROR_LED_PIN, HIGH);
      DEBUG_PRINTLN("Failed!, Caching for later.");
      failedSubmissionIndexes[failedIndex++] = i;
      numConsecutiveFails++;
    } else {
			mcp.digitalWrite(OK_LED_PIN, HIGH);
      numConsecutiveFails = 0;
    }

    // If the index is also the number of fails
    // And if we've failed too many times in a row then quit
    // The server must be down
    if (i == numConsecutiveFails-1 && numConsecutiveFails > MAX_FAILED_SUBMITS) {
			// Turn lamps off
			mcp.digitalWrite(OK_LED_PIN, LOW);
			mcp.digitalWrite(ERROR_LED_PIN, LOW);

      DEBUG_PRINT("Aborting submission, the server must be down. Counter is: ");
      serverDownCounter = READING_SUBMIT_INTERVAL; // Includes 0 so 4 is don't try for 4 times and try on the 5th
      DEBUG_PRINTLN(serverDownCounter);
      disconnectFromWiFi();
      return;
    }

    // Don't want to overload (Need multi submit really)
    delay(50);

		// Turn lamps off
		mcp.digitalWrite(OK_LED_PIN, LOW);
		mcp.digitalWrite(ERROR_LED_PIN, LOW);
  }

  // Iterate through the reading indexes and if it's an index less than the failed count means it's a failed one
  // Get the associated index from the readings and copy its data over
  /* I think this is just changing the reference maybe ? */
  for (int i=0; i<MAX_READING_STORAGE; i++) {
    // If it is within the count of failed indexes we need to put storedReadings[failIndex[i]] at storedReadings[i]
    if (i < failedIndex) {
      //copyWeatherReading(source, dest);
      //storedReadings[i] = storedReadings[failedSubmissionIndexes[i]];
      //^Was like that before but after the server being down for a while when it finally came back up the esp only submitted the last few readings or random ones
      // No idea why should work according to tests on my desk. Maybe was passing reference so they got overwritten?
      copyWeatherReading(storedReadings[failedSubmissionIndexes[i]], storedReadings[i]);
    // Else flag it as not populated/zero it
    } else {
			zeroWeatherReading(&storedReadings[i]);
      //storedReadings[i].populated = false;
    }
  }

  // Set the current index to the index of where the failed readings stopped
  readingIndex = failedIndex;

  // If we've failed on all then set the index back to zero
  if (readingIndex == MAX_READING_STORAGE) {
    readingIndex = 0;
  }

  DEBUG_PRINTLN();
  DEBUG_PRINT("New index: ");
  DEBUG_PRINTLN(readingIndex);

  disconnectFromWiFi();
}





void ICACHE_RAM_ATTR do_mcp_isr() {
	hasInterrupt = true;
}

void setup() {
  Serial.begin(19200);
  //Serial.setTimeout(500);
	Serial.setDebugOutput(true);

	// Maybe store this ?
	Serial.println("");
	Serial.println("Reset Reason:");
	Serial.println(ESP.getResetReason());
	Serial.println("Reset Info:");
	Serial.println(ESP.getResetInfo());
	Serial.println("Wifi Diagnosis:");
	WiFi.printDiag(Serial);

  // Wait for serial to initalize
  while (!Serial) {}

	struct rst_info *rtc_info = system_get_rst_info();

	Serial.printf("reset reason: %x\n", rtc_info->reason);

	if (rtc_info->reason == REASON_WDT_RST ||
		rtc_info->reason == REASON_EXCEPTION_RST ||
		rtc_info->reason == REASON_SOFT_WDT_RST) {
			if (rtc_info->reason == REASON_EXCEPTION_RST) {
				Serial.printf("Fatal exception (%d):\n", rtc_info->exccause);
			}
			Serial.printf("epc1=0x%08x, epc2=0x%08x, epc3=0x%08x, excvaddr=0x%08x, depc=0x%08x\n",
				rtc_info->epc1, rtc_info->epc2, rtc_info->epc3, rtc_info->excvaddr, rtc_info->depc);//The address of the last crash is printed, which is used to debug garbled output.
	}

	// SoftwareSerial
	ATtinySerial.begin(300);

	// Wire.begin(SDA, SCL);
	Wire.begin(SDA_PIN, SCL_PIN);
	//Wire.setClockStretchLimit(1600); // Maybe for attiny

  // mcp23008 begin
  mcp.begin();      // use default address 0

	// We'll have this as input until we need a reading so we don't interfere with attiny programming
	mcp.pinMode(ATTINY_DATA_REQUEST_PIN, INPUT);

  // Set the interrupt pin mode
  //mcp.setInterruptOutPinMode(MCP23008_INT_OUT_HIGH);

	// Attach our handler to the interrupt trigger pin with an interrupt
	//attachInterrupt(digitalPinToInterrupt(INTERRUPT_PIN), do_mcp_isr, RISING);

	//gpio_pin_wakeup_enable(INTERRUPT_PIN, GPIO_PIN_INTR_HILEVEL);

  // SPI init
	// D5 Clock
	// D6 MOSI
	// D7 MISO
  SPI.begin();
  mcp.pinMode(ADC_CS_PIN, OUTPUT);
	mcp.digitalWrite(ADC_CS_PIN, HIGH);

  // LEDs
  mcp.pinMode(OK_LED_PIN, OUTPUT);
  mcp.pinMode(ERROR_LED_PIN, OUTPUT);

	// Turn them on for init
  mcp.digitalWrite(OK_LED_PIN, HIGH);
  mcp.digitalWrite(ERROR_LED_PIN, HIGH);

  // Clock
  RTC.begin();

  // Check to see if the RTC is keeping time.  If it is, load the time from your computer.
  if (!RTC.isrunning()) {
    DEBUG_PRINTLN("RTC is NOT running!");
    // This will reflect the time that your sketch was compiled
    RTC.adjust(DateTime(__DATE__, __TIME__));
  }

	// Store the power on time
	powerOnTime = RTC.now().unixtime();

  //******************************
  //* WiFi
  //******************************
	WiFi.persistent(false); // Don't store info to flash
	//noInterrupts();
	WiFi.forceSleepBegin(); // This'll call WiFi.mode(WIFI_OFF);
	//interrupts();
	//WiFi.mode(WIFI_OFF);
	delay(1);
  //wifi_set_sleep_type(LIGHT_SLEEP_T);

	//******************************
	//* For the reference voltage
	//******************************
	mcp.pinMode(REFV_ENABLE_PIN, OUTPUT);
	//mcp.digitalWrite(REFV_ENABLE_PIN, LOW);
	mcp.digitalWrite(REFV_ENABLE_PIN, HIGH);

  //******************************
  //* Enable the solar panel
  //******************************
  mcp.pinMode(SOLAR_ENABLE_PIN, OUTPUT);
  mcp.digitalWrite(SOLAR_ENABLE_PIN, HIGH);

  //******************************
  //* Battery divider enable pin
  //******************************
  mcp.pinMode(BAT_DIV_ENABLE_PIN, OUTPUT);
  mcp.digitalWrite(BAT_DIV_ENABLE_PIN, LOW);

  //******************************
  //* Init Wind Vane
  //******************************
  //pinMode(WIND_VANE_ENABLE_PIN, OUTPUT);
  //digitalWrite(WIND_VANE_ENABLE_PIN, HIGH);

  //******************************
  //* Start Anemometer Counting
  //******************************
  // Enable interrupt for pin 2
  //mcp.pinMode(ANEMOMETER_PIN, INPUT);
  //mcp.enableInterrupt(ANEMOMETER_PIN, RISING);

  anemometerPulseCount = 0;
  lastAnemometerReadingMillis = millis();

  //******************************
  //* Start BME sensor
  //******************************
	#if BME_SENSOR == SENS_BME280
  bmeConnected = bmeSensor.begin(0x76);

