scabootssca/weatherstation/Src/ESP8266/OLD/ESP8266.ino.REFERENCE.cpp
	// Then set it to forced so we sleep
	if (bmeConnected) {
		bmeSensor.setSampling(
			bmeSensor.MODE_FORCED,
			bmeSensor.SAMPLING_X16,
			bmeSensor.SAMPLING_X16,
			bmeSensor.SAMPLING_X16,
			bmeSensor.FILTER_OFF,
			bmeSensor.STANDBY_MS_0_5
		);
	} else {
		Serial.println("BME280 sensor is not detected at i2caddr 0x76; check wiring.");
	}
	#endif

	#if BME_SENSOR == SENS_BMP180
	bmeConnected = bmeSensor.begin();
	#endif


	// Init is done turn them back off
  mcp.digitalWrite(OK_LED_PIN, LOW);
  mcp.digitalWrite(ERROR_LED_PIN, LOW);

	//digitalWrite(AWAKE_PIN, LOW);
}

bool takeSample() {
	// Get the reading from the ATtiny
	mcp.pinMode(ATTINY_DATA_REQUEST_PIN, OUTPUT);
	mcp.digitalWrite(ATTINY_DATA_REQUEST_PIN, HIGH);
	delay(1);

	lastSampleMillis = millis();

	#if SAMPLE_INDICATOR_LED_ENABLED
	mcp.digitalWrite(OK_LED_PIN, HIGH);
	#endif

	DEBUG_PRINTLN();
	DEBUG_PRINT("Taking Sample Num: ");
	DEBUG_PRINT(numSamples+1);
	DEBUG_PRINT("/");
	DEBUG_PRINT(SAMPLES_PER_READING);
	DEBUG_PRINT(" for reading buffer index: ");
	DEBUG_PRINT(readingIndex);
	DEBUG_PRINT(" of total readings: ");
	DEBUG_PRINTLN(totalReadings);

	// Store the time
	lastSampleMillis = millis();

	//******************************************/
	//* Battery block
	//******************************************/
	// float batteryVoltage = readBatteryVoltage();
	if (numSamples % BATTERY_SAMPLE_MODULO == 0) {
		sampleAccumulator->battery += readBatteryVoltage();
		sampleAccumulator->numBatterySamples += 1;
	}

	//******************************************/
  //* TEMPERATURE, HUMIDITY, BAROMETER BLOCK */
  //******************************************/
  float bmeTemp = NAN;
  float bmePressure = NAN;
  float bmeHumidity = NAN;

  if (bmeConnected) {
		for (int i=0; i<5; i++) {
			#if BME_SENSOR == SENS_BME280
			// Need this cause we'll be sleeping all the other time
			bmeSensor.takeForcedMeasurement();

			bmeTemp = bmeSensor.readTemperature();
			bmePressure = bmeSensor.readPressure();
			bmeHumidity = bmeSensor.readHumidity();

			if (!isnan(bmeTemp) && !isnan(bmePressure) && !isnan(bmeHumidity)) {
				break;
			}
			#endif

			#if BME_SENSOR == SENS_BMP180
			bmeTemp = bmeSensor.readTemperature();
			bmePressure = bmeSensor.readPressure();

			if (!isnan(bmeTemp) && !isnan(bmePressure)) {
				break;
			}
			#endif
		}
  }

  //******************************************/
  //* WIND VANE BLOCK
  //******************************************/
  int windDegrees = readWindVane();

  //******************************************/
  //* ATTINY INTERRUPT READINGS
  //******************************************/
	float anemometerMph = 0;

	bool recvSuccess = wait_attiny_data();
	int numTimelyAnemometerSamples = 0;

	if (recvSuccess) {
		// Get how many samples we had
		numTimelyAnemometerSamples = (int)attinyReplyBuffer[3];
	}

	// mph = revolutions * measurementDuration * calibrationData
	unsigned long millisNow = millis();
	anemometerMph = (numTimelyAnemometerSamples * 0.5) * (60000.0 / (millisNow-lastAnemometerReadingMillis)) * ANEMOMETER_CALIBRATION_COEF;

	#if DEBUG >= 2
	DEBUG_PRINT("Anemometer: ");
  DEBUG_PRINT(numTimelyAnemometerSamples);
  DEBUG_PRINT(" Samples in last ");
  DEBUG_PRINT((millisNow-lastAnemometerReadingMillis)/1000.0);
  DEBUG_PRINT(" second ");
  DEBUG_PRINT(anemometerMph);
  DEBUG_PRINTLN(" MPH");
	#endif

	lastAnemometerReadingMillis = millisNow;

	//float batteryPercent = getBatteryPercent(batteryVoltage, bmeTemp);
	//Serial.printf("Battery Percent: %s\n", String(batteryPercent).c_str());




  //*****************/
  //* STORAGE BLOCK */
  //*****************/
	numSamples++;
	//DateTime now = RTC.now();
	//sampleAccumulator->timestamp = now.unixtime();
	sampleAccumulator->temperature += bmeTemp;
	sampleAccumulator->humidity += bmeHumidity;
	sampleAccumulator->pressure += bmePressure;
	//sampleAccumulator->battery += batteryVoltage;
	sampleAccumulator->windSpeed += anemometerMph;
	sampleAccumulator->windDirection += windDegrees;

	#if DEBUG > 2
	WeatherReading sampleReading;

	DateTime now = RTC.now();
	sampleReading.timestamp = now.unixtime();
	sampleReading.temperature = bmeTemp;
	sampleReading.humidity = bmeHumidity;
	sampleReading.pressure = bmePressure;
	sampleReading.battery = sampleAccumulator->battery/float(sampleAccumulator->numBatterySamples);
	sampleReading.windSpeed = anemometerMph;
	sampleReading.windDirection = windDegrees;

	// Serial.print("Num samples: ");
	// Serial.println(sampleAccumulator->numBatterySamples);

	printWeatherReading(sampleReading);
	#endif

	// If we've reached the last reading then goto the beginning again
	if (numSamples >= SAMPLES_PER_READING) {
		numSamples = 0;
	}

	// Turn the light off again
	mcp.digitalWrite(ERROR_LED_PIN, LOW);
	mcp.digitalWrite(OK_LED_PIN, LOW);

	DEBUG_PRINT("Free Heap: ");
	DEBUG_PRINTLN(ESP.getFreeHeap(), DEC);

	mcp.digitalWrite(ATTINY_DATA_REQUEST_PIN, LOW);
	mcp.pinMode(ATTINY_DATA_REQUEST_PIN, INPUT);
}

void storeAveragedSamples() {
	// Output
	DEBUG_PRINTLN();
	DEBUG_PRINT("Averaging samples as reading: ");
	DEBUG_PRINTLN(readingIndex);

	WeatherReading *currentReading = &storedReadings[readingIndex++];
	totalReadings++; // Add one to the total readings

	// Save the time
	DateTime now = RTC.now();
	currentReading->timestamp = now.unixtime();

	// Divide the accumulator by the num samples for the average reading
	currentReading->temperature = sampleAccumulator->temperature/float(SAMPLES_PER_READING);
	currentReading->humidity = sampleAccumulator->humidity/float(SAMPLES_PER_READING);
	currentReading->pressure = sampleAccumulator->pressure/float(SAMPLES_PER_READING);
	if (sampleAccumulator->numBatterySamples) {
		currentReading->battery = sampleAccumulator->battery/float(sampleAccumulator->numBatterySamples);
	}
	currentReading->windSpeed = sampleAccumulator->windSpeed/float(SAMPLES_PER_READING);
	currentReading->windDirection = sampleAccumulator->windDirection/float(SAMPLES_PER_READING);
	currentReading->populated = true;

	zeroWeatherReading(sampleAccumulator);

