scabootssca/weatherstation/Src/ESP8266/OLD/ESP8266.ino.REFERENCE.cpp
	printWeatherReading(*currentReading);

	// If we've reached the last reading then goto the beginning again
	if (readingIndex >= MAX_READING_STORAGE) {
		readingIndex = 0;
	}
}


void save_sample_attiny() {
	//char serialized[] = serialize_sample(sampleAccumulator);
}

void loop() {
	/*******************************************************\
	|*
	|* For calibrating the wind vane when changing wires or whatever
	|*
	|*******************************************************/
	// #if CALIBRATION_MODE
	// int windVaneReading = readSPIADC(WIND_VANE_PIN);
  //
	// if (windVaneReading > CALIB_windVaneMax) {
	// 	CALIB_windVaneMax = windVaneReading;
	// }
  //
	// if (windVaneReading < CALIB_windVaneMin) {
	// 	CALIB_windVaneMin = windVaneReading;
	// }
  //
	// if (millis()-lastSampleMillis > 1000) {
	// 		Serial.print("Wind Vane Max: ");
	// 		Serial.println(CALIB_windVaneMax);
	// 		Serial.print("Wind Vane Min: ");
	// 		Serial.println(CALIB_windVaneMin);
	// 		lastSampleMillis = millis();
  //
	// }
  //
	// return;
	// #endif

	/*******************************************************\
	|*
	|* Companion mode with ATtiny
	|*
	|*******************************************************/
	#if COMPANION_MODE
	// Print what it prints through us
	recv_attiny_serial();

	if (millis()-lastSampleMillis > SAMPLE_INTERVAL) {
		lastSampleMillis = millis();
		// Take a weather reading sample
		//takeSample();

		// Send it to attiny for storage
		//save_sample_attiny();
		ATtinySerial.println("Frogs");
		ATtinySerial.flush(); // Make sure its transmitted

		DEBUG_PRINTLN("Sleeping Now.");
		//ESP.deepSleep(0);
	}

	#endif

	//ESP.deepSleep(0);
	//delay(5000);

	/*******************************************************\
	|*
	|* Standalone Mode
	|*
	|*******************************************************/
	// #else
	// if (millis()-lastSampleMillis < SAMPLE_INTERVAL) {
	// 	if (hasInterrupt) {
	// 		//noInterrupts();
	// 		hasInterrupt = false;
	// 		//interrupts();
  //
	// 		// if (mcp.interruptOn(ANEMOMETER_PIN)) {
	// 		//   anemometerPulseCount++;
	// 		// }
	// 	}
  //
	// 	delay(10);
	// 	return;
	// }
  //
	// Serial.println("Starting loop");
  //
	// #if SAMPLE_INDICATOR_LED_ENABLED
	// mcp.digitalWrite(OK_LED_PIN, HIGH);
	// #endif
  //
	// // Take a weather reading sample
	// takeSample();
  //
	// // If we're at the first sample then we've taken all of ours
	// if (numSamples == 0) {
	// 	storeAveragedSamples();
  //
	//   //****************/
	//   //* OUTPUT BLOCK */
	//   //****************/
	//   // Count the attemts to wait at least serverDownCounter attempts before submitting again
	//   if (serverDownCounter > 0) {
// 	//     serverDownCounter--;
// 	//     DEBUG_PRINT("Server down counter is now: ");
// 	//     DEBUG_PRINTLN(serverDownCounter);
// 	//   // All good then submit every READING_SUBMIT_INTERVAL
// 	// 	}
//   //
// 	// 	if (!serverDownCounter && readingIndex >= READING_SUBMIT_INTERVAL) {
// 	//     DEBUG_PRINT("Starting Submitting Readings");
// 	//     submit_stored_readings();
// 	//   }
// 	// }
//   //
// 	// // Turn the light off again
// 	// mcp.digitalWrite(ERROR_LED_PIN, LOW);
// 	// mcp.digitalWrite(OK_LED_PIN, LOW);
//   //
// 	// // It'll be negative if we've waited long enough or millis rolls over
// 	// int sleepLength = SAMPLE_INTERVAL-(millis()-lastSampleMillis);
//   //
// 	// DEBUG_PRINT("Free Heap: ");
// 	// DEBUG_PRINTLN(ESP.getFreeHeap(), DEC);
//   //
// 	// if (sleepLength > 0) {
// 	// 	DEBUG_PRINT("Sleeping For: ");
// 	// 	DEBUG_PRINT(sleepLength);
// 	// 	DEBUG_PRINTLN(" ms ");
//   //
// 	//   #if ENABLE_DEEP_SLEEP
// 	//   ESP.deepSleep(sleepLength*1000);
// 	//   #else
// 	// 	//delay(sleepLength);
// 	//   #endif
// 	// } else {
// 	// 	DEBUG_PRINTLN("Taking next reading directly.");
// 	// }
// 	// #endif
// }
